wise-guy-server/app/controllers/jokes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    # joke = Joke.find(params[:id])
    # render json: joke
    current_user = User.find(params[:id])