wise-guy-server/app/controllers/jokes_controller.rb

  def index
    jokes = Joke.all
---
SELECT "jokes".* FROM "jokes"

  def show
    joke = Joke.find(params[:id])
---
SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    joke = Joke.create!(joke_params)
---
INSERT INTO "jokes" ("name", "joke_text", "estimated_length", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["joke_text", "Test"], ["estimated_length", "Test"], ["created_at", "2018-03-13 19:37:00.872528"], ["updated_at", "2018-03-13 19:37:00.872528"]]

  def update
    joke = Joke.find(params[:id])
    joke.update!(joke_params)
---
SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "jokes" SET "name" = $1, "joke_text" = $2, "estimated_length" = $3, "updated_at" = $4 WHERE "jokes"."id" = $5  [["name", "No test"], ["joke_text", "No test"], ["estimated_length", "No test"], ["updated_at", "2018-03-13 19:37:12.683458"], ["id", 13]]

  def destroy
    joke = Joke.find(params[:id])
    joke.destroy!
---
SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "jokes" WHERE "jokes"."id" = $1  [["id", 13]]