wise-guy-server/app/controllers/routines_controller.rb

SELECT "routines".* FROM "routines"
---
  def index
    routines = Routine.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    # routine = Routine.find(params[:id])
    # render json: routine
    current_user = User.find(params[:id])

INSERT INTO "routines" ("user_id", "name", "estimated_length", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["name", "Latest test"], ["estimated_length", "Latest test"], ["created_at", "2018-03-14 16:03:59.109001"], ["updated_at", "2018-03-14 16:03:59.109001"]]
---
  def create
    routine = Routine.create!(routine_params)

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "routines" SET "name" = $1, "estimated_length" = $2, "updated_at" = $3 WHERE "routines"."id" = $4  [["name", "MORE Test routine"], ["estimated_length", "09:30:00"], ["updated_at", "2018-03-12 19:08:45.832792"], ["id", 9]]
---
  def update
    routine = Routine.find(params[:id])
    routine.update!(routine_params)

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "routines" WHERE "routines"."id" = $1  [["id", 9]]
---
  def destroy
    routine = Routine.find(params[:id])
    routine.destroy!