wise-guy-server/app/controllers/routines_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def index
    current_user = User.find(params[:id])