wise-guy-server/app/controllers/routine_with_jokes_controller.rb

  def index
    routineWithJokes = RoutineWithJoke.all
---
SELECT "routine_with_jokes".* FROM "routine_with_jokes"

  def show
    routineWithJoke = RoutineWithJoke.find(params[:id])
---
SELECT  "routine_with_jokes".* FROM "routine_with_jokes" WHERE "routine_with_jokes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]