wise-guy-server/app/controllers/users_controller.rb

    def create
      email = params[:email]
      password = params[:password]
      first_name = params[:first_name]
      last_name = params[:last_name]

      new_user = User.new({
        password: password,
        email: email,
        first_name: first_name,
        last_name: last_name
      })


      if new_user.valid?
        new_user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "John"], ["last_name", "Boyle"], ["email", "john@john.com"], ["password_digest", "john"], ["created_at", "2018-03-12 18:06:57.563503"], ["updated_at", "2018-03-12 18:06:57.563503"]]

    def login
      email = params[:email]
      password = params[:password]

      user = User.find_from_credentials email, password
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "garrett"], ["LIMIT", 1]]