app/controllers/routines_controller.rb

  def index
    routines = Routine.all
---
SELECT "routines".* FROM "routines"