app/controllers/routine_with_jokes_controller.rb

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    routine = Routine.find(params[:id])

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    current_routine = Routine.find(params[:id])

INSERT INTO "routine_with_jokes" ("routine_id", "joke_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["routine_id", 2], ["joke_id", 1], ["created_at", "2018-03-29 08:55:21.302186"], ["updated_at", "2018-03-29 08:55:21.302186"]]
---
  def create
    routineId = params[:routine_id]
    jokeId = params[:joke_id]
    routineWithJoke = RoutineWithJoke.create!(routine_id: routineId, joke_id: jokeId)

DELETE FROM "routine_with_jokes" WHERE "routine_with_jokes"."id" = $1  [["id", 13]]
SELECT "routine_with_jokes".* FROM "routine_with_jokes" WHERE "routine_with_jokes"."routine_id" = $1 AND "routine_with_jokes"."joke_id" = $2  [["routine_id", 2], ["joke_id", 1]]
---
  def destroy
    routineId = params[:routine_id]
    jokeId = params[:joke_id]
    routineWithJoke = RoutineWithJoke.find_by(routine_id: routineId, joke_id: jokeId).destroy