app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "John"], ["last_name", "Boyle"], ["email", "john@john.com"], ["password_digest", "john"], ["created_at", "2018-03-12 18:06:57.563503"], ["updated_at", "2018-03-12 18:06:57.563503"]]

  def update
    user = User.find(params[:id])
    user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "email" = $3, "password_digest" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Mary"], ["last_name", "Blige"], ["email", "mary@john.com"], ["password_digest", "mary"], ["updated_at", "2018-03-12 18:08:02.558711"], ["id", 5]]

  def destroy
    user = User.find(params[:id])
    user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]